app/views/movements/_form.html.erb

SELECT  "movements".* FROM "movements"  ORDER BY "movements"."id" ASC LIMIT 1
---
			<%= f.label :name %>
			<% names = Movement.all.map {|move| [move.name]} %>