app/views/wods/_form.html.erb

	<%= f.text_field :description %>
	<%= f.collection_check_boxes :movement_ids, Movement.all, :id, :name %><br>
---
SELECT "movements".* FROM "movements"