app/views/wods/_movement.html.erb

<%= f.label :movement %>
<% names = Movement.all.map {|move| [move.name]} %>
---
SELECT "movements".* FROM "movements"