app/views/wods/_show.html.erb

<h2>Wod Type: For <%= wod.wod_type %></h2>
<h2>Wod Movements: </h2><% wod.movements.each do |move| %>
---
SELECT "movements".* FROM "movements" INNER JOIN "move_wods" ON "movements"."id" = "move_wods"."movement_id" WHERE "move_wods"."wod_id" = ?  [["wod_id", 6]]