app/views/wods/new.html.erb

	<%= f.text_field :quantity %><br>
	<%= f.collection_check_boxes :movement_ids, Movement.all, :id, :name %><br>
---
SELECT "movements".* FROM "movements"