app/views/wods/show.html.erb

SELECT  "movements".* FROM "movements" INNER JOIN "move_wods" ON "movements"."id" = "move_wods"."movement_id" WHERE "move_wods"."wod_id" = ? AND "movements"."movement_id" IS NULL LIMIT 1  [["wod_id", 21]]
---
<h2>Wod Type: </h2><h3>For <%= @wod.wod_type %></h3>
<h2>Wod Movements: </h2><% @wod.movements.each do |move| %>