app/views/usermovements/_form.html.erb

SELECT  "movements".* FROM "movements" WHERE "movements"."name" IS NULL LIMIT 1
SELECT "usermovements".* FROM "usermovements"
---
		<%= f.label :name %>
		<% names = Usermovement.all.map {|move| [move.name]} %>