app/controllers/movements_controller.rb

SELECT "movements".* FROM "movements"
---
	def index
		@movements = Movement.all

SELECT  "movements".* FROM "movements"  ORDER BY "movements"."id" ASC LIMIT 1
---
	def new
		@movement = Movement.new
		@moves = Movement.all

INSERT INTO "movements" ("name", "movement_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "chest to bar"], ["movement_type", "repetitions"], ["created_at", "2017-05-31 05:01:27.111432"], ["updated_at", "2017-05-31 05:01:27.111432"]]
---
	def create
		@user = current_user
		@movement = Movement.new(movement_params)
		if @movement.save

UPDATE "movements" SET "result" = ?, "updated_at" = ? WHERE "movements"."id" = ?  [["result", 106.0], ["updated_at", "2017-05-31 08:33:08.289986"], ["id", 12]]
---
	def update
		set_movement
		if @movement.update(movement_params)

DELETE FROM "movements" WHERE "movements"."id" = ?  [["id", 1]]
---
	def destroy
		set_movement.destroy

SELECT  "movements".* FROM "movements" WHERE "movements"."id" = ? LIMIT 1  [["id", 12]]
---
	def set_movement
		@movement = Movement.find(params[:id])