app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "Max Charles"]]
---
	def create
		if auth_hash = request.env['omniauth.auth']
			if @user = User.find_by(email: auth_hash["info"]["email"])
				session[:user_id] = @user.id
			else @user = User.create_with_omniauth(auth_hash)
				session[:user_id] = @user.id
			end
			redirect_to root_path
		else
			@user = User.find_by(:name => params[:user][:name])