app/controllers/usermovements_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
SELECT "usermovements".* FROM "usermovements" WHERE "usermovements"."user_id" = ?  [["user_id", 1]]
---
	def index
		if params[:user_id]
			set_user
			if params[:user_id] == current_user.id.to_s
				@usermovements = User.find(params[:user_id]).usermovements

INSERT INTO "usermovements" ("name", "result", "pr", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dead Lift"], ["result", 160.0], ["pr", "t"], ["date", "2017-06-10"], ["created_at", "2017-06-12 11:47:25.975610"], ["updated_at", "2017-06-12 11:47:25.975610"]]
SELECT  "movements".* FROM "movements" WHERE "movements"."name" = ? LIMIT 1  [["name", "Dead Lift"]]
UPDATE "usermovements" SET "movement_type" = ?, "updated_at" = ? WHERE "usermovements"."id" = ?  [["movement_type", "weight"], ["updated_at", "2017-06-12 13:16:47.608479"], ["id", 7]]
---
	def create
		@usermovement = Usermovement.new(usermovement_params)
		if @usermovement.save
			move = Movement.all.find_by(name: @usermovement.name)
			@usermovement.movement_type = move.movement_type
			@usermovement.save

UPDATE "usermovements" SET "result" = ?, "updated_at" = ? WHERE "usermovements"."id" = ?  [["result", 165.0], ["updated_at", "2017-06-12 11:57:17.563225"], ["id", 1]]
---
	def update
		set_usermovement
		if @usermovement.update(usermovement_params)

DELETE FROM "usermovements" WHERE "usermovements"."id" = ?  [["id", 1]]
---
	def destroy
		if params[:user_id]
			set_user
			if params[:user_id] == current_user.id.to_s
				set_usermovement.destroy

SELECT "movements".* FROM "movements"
---
	def set_movement
		@movements = Movement.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
---
	def set_user
		@user = User.find_by(id: params[:user_id])

SELECT  "usermovements".* FROM "usermovements" WHERE "usermovements"."id" = ? LIMIT 1  [["id", 1]]
---
	def set_usermovement
		@usermovement = Usermovement.find_by(id: params[:id])