app/controllers/userwods_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
	def index
		if params[:user_id] == current_user.id.to_s
			@userwods = User.find(params[:user_id]).userwods

SELECT "wods".* FROM "wods"
---
	def new
		@userwod = Userwod.new(user_id: params[:user_id])
		set_user
		@wods = Wod.all

INSERT INTO "userwods" ("name", "result", "pr", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Grace"], ["result", 10.0], ["pr", "t"], ["created_at", "2017-06-12 13:38:27.784028"], ["updated_at", "2017-06-12 13:38:27.784028"]]
SELECT  "wods".* FROM "wods" WHERE "wods"."title" = ? LIMIT 1  [["title", "Helen"]]
UPDATE "userwods" SET "wod_type" = ?, "updated_at" = ? WHERE "userwods"."id" = ?  [["wod_type", "time"], ["updated_at", "2017-06-13 01:21:44.586841"], ["id", 2]]
---
	def create
		@userwod = Userwod.new(userwod_params)
		if @userwod.save
			wod = Wod.all.find_by(title: @userwod.name)
			@userwod.wod_type = wod.wod_type
			@userwod.save

UPDATE "userwods" SET "result" = ?, "date" = ?, "updated_at" = ? WHERE "userwods"."id" = ?  [["result", 5.5], ["date", "2017-06-13"], ["updated_at", "2017-06-13 01:39:42.060095"], ["id", 1]]
---
	def update
		set_userwod
		if @userwod.update(userwod_params)

SELECT  "userwods".* FROM "userwods" WHERE "userwods"."id" = ? LIMIT 1  [["id", 1]]
---
	def set_userwod
		@userwod = Userwod.find(params[:id])