app/controllers/userwods_controller.rb

SELECT "userwods".* FROM "userwods"
---
	def index
		@userwods = Userwod.all