app/controllers/usermovements_controller.rb

	def show
		set_usermovement
		@movement = Movement.find_by(name: @usermovement.name)
---
SELECT  "movements".* FROM "movements" WHERE "movements"."name" = ? LIMIT 1  [["name", "Dead Lift"]]