app/controllers/users_controller.rb

	def index
		# Ensure only an owner can view all users
		if current_user.owner == true
			@users = User.all.sort_by {|user| user.name.downcase}
---
SELECT "users".* FROM "users"

	def update
		set_user
		if @user == current_user
			if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Skai Jacksons"], ["password_digest", "$2a$10$YGgt/g0OaBrEins09RjQRucZo4fdUEaCkTZ7qnnRbqwVeOheemFbG"], ["updated_at", "2017-06-14 01:18:36.803852"], ["id", 2]]