app/controllers/wods_controller.rb

	def index
		@wods = Wod.all
---
SELECT "wods".* FROM "wods"

	def create
		@wod = Wod.new(wod_params)
		if @wod.save
---
INSERT INTO "move_wods" ("wod_id", "movement_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wod_id", 8], ["movement_id", 10], ["created_at", "2017-06-12 06:34:34.181092"], ["updated_at", "2017-06-12 06:34:34.181092"]]
INSERT INTO "wods" ("name", "wod_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Snatch"], ["wod_type", "repetitions"], ["created_at", "2017-06-09 02:01:08.157638"], ["updated_at", "2017-06-09 02:01:08.157638"]]

	def set_wod
		@wod = Wod.find(params[:id])
---
SELECT  "wods".* FROM "wods" WHERE "wods"."id" = ? LIMIT 1  [["id", 1]]